{"price": "1099", "description": "COPPER BENEFITS\n\r\n\tCopper is an antioxidant and anti-carcinogenic that prevents cell damage and slows ageing. Copper is a primary element to produce melanin (pigmentation of eyes, hair and skin) in a human body. Water stored overnight in copper utensil is essential for haemoglobin synthesis, bone strength and immunity building. Copper helps in maintaining digestive health, healing wounds and relieving pains.\n\r\n\t \n\nCOPPER IS AN ESSENTIAL MINERAL FOR BODY\n\r\n\t•Copper is a mineral that is found throughout the body. It helps your body make red blood cells and keeps nerve cells and your immune system healthy\n\r\n\t•It also helps form collagen, a key part of bones and connective tissue.\n\r\n\t•Copper also act as an antioxidant, reducing free radicals that can damage cells and DNA\n\r\n\t•Prevents water-borne diseases\n\r\n\t•Keeps digestive system healthy\n\r\n\t•Aids weight loss\n\r\n\t•Boosts heart health\n\r\n\t•Promotes healthy skin\n\r\n\t•Beats anaemia\n\r\n\t \n\nARTISAN CRAFTED\n\r\n\tHandmade metal ware is made by skilled craftsmen in India.\n\r\n\t \n\nMIRROR FINISH\n\r\n\tPlain mirror finish ensures proper cleaning and maintenance of the product. It also ensures virgin copper material is used free from all defects.\n\r\n\t \n\nCOPPER CARE\n\r\n\t100% copper utensils stain and darken over a period of time. This happens naturally, due to a process called oxidation. If your copper utensils are getting darken, don’t worry. It’s an assurance that you have purchased 100% copper product. Clean as per suggestive process and it would be as new as ever. Clean it regularly and keep it dry.\n\r\n\t \n\nCOPPER CLEANING METHODS\n\r\n\t•Use a vinegar-salt solution or rub it with lemon sprinkled with salt. Rinse and dry jug and glasses.\n\r\n\t•Use some lemon juice and hot water in a bottle and shake it well allow it to stand for a few minutes and then wash off with plain water.\n\r\n\t \n\nNote - don’t use metal scrubber as copper is a soft material, it can cause scratches on its surfaces."}